#include<iostream>
#include <windows.h>

using namespace std;

int main() {

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Выдуманная информация 50/50 :)

    cout << "**************************************************\n";
    cout << "                    РЕЗЮМЕ                      \n";
    cout << "**************************************************\n";

    cout << "\n**************************************************\n";
    cout << "            Имя и контактные данные               \n";
    cout << "\nИмя: Сидоренко Денис\n";
    cout << "Email: *******@gmail.com.com\n";
    cout << "Телефон: +380123456789\n";
    cout << "Адрес: Украина, Днепр\n";
    cout << "Дата рождения: 1 января 1777 года\n";
    cout << "Социальные сети: GitHub: github.com/soolrin\n";
    cout << "**************************************************\n";

    cout << "\n**************************************************\n";
    cout << "           Профессиональное направление           \n";
    cout << "\nПрофессия: Разработчик программного обеспечения\n";
    cout << "Я занимаюсь созданием высококачественных и производительных приложений,\n";
    cout << "работаю с передовыми технологиями, всегда стремлюсь к совершенству в\n";
    cout << "каждом проекте, который выполняю.\n";
    cout << "**************************************************\n";

    cout << "\n**************************************************\n";
    cout << "                    Образование                      \n";
    cout << "\nБакалавр в области информатики\n";
    cout << "(Днепровский национальный университет имени Олеся Гончара, 2017 - 2021)\n";
    cout << "- Углубленные знания по алгоритмам, структурам данных и базам данных.\n";
    cout << "- Курсы по машинному обучению и искусственному интеллекту.\n";
    cout << "- Основы программирования на C, C#, C++, Python.\n";
    cout << "**************************************************\n";

    cout << "\n**************************************************\n";
    cout << "                    Навыки                      \n";
    cout << "- C++ (продвинутый уровень): создание многозадачных и многопоточных\n";
    cout << "  приложений, оптимизация производительности.\n";
    cout << "- Python (средний уровень): разработка скриптов и автоматизация процессов.\n";
    cout << "- SQL (средний уровень): работа с реляционными базами данных.\n";
    cout << "- Git (опыт работы): ведение репозиториев, работа с ветками.\n";
    cout << "- HTML/CSS (основы): создание простых веб-страниц.\n";
    cout << "**************************************************\n";


    cout << "\n**************************************************\n";
    cout << "                    Опыт работы                \n";
    cout << "1. Разработчик ПО в компании Google (2021 - настоящее время)\n";
    cout << "- Разработка и поддержка программного обеспечения на C++ и Python.\n";
    cout << "- Проектирование и оптимизация баз данных.\n";


    cout << "\n2. Стажер-разработчик в компании Microsoft (2020 - 2021)\n";
    cout << "- Участие в разработке на C++.\n";
    cout << "**************************************************\n";


    cout << "\n**************************************************\n";
    cout << "                 Личностные качества                 \n";
    cout << "- Стремление к обучению: активно обучаюсь новым технологиям и языкам программирования.\n";
    cout << "- Проблемно-ориентированность: умею анализировать и решать сложные задачи.\n";
    cout << "**************************************************\n";

    cout << "\n**************************************************\n";
    cout << "                 Курсы и сертификации           \n";
    cout << "- Сертификат по курсу 'Основы C++' от Академии ШАГ (2021)\n";
    cout << "- Сертификат по курсу 'Разработка на Python' от Академии ШАГ (2022)\n";
    cout << "**************************************************\n";

    cout << "\n**************************************************\n";
    cout << "                       Проекты  \n";
    cout << "1. Разработка игры Tower Defense\n";
    cout << "   (Использовались: Python)\n";
    cout << "2. Создание веб-страницы онлайн магазина с использованием Python\n";
    cout << "   (Использовались: HTML/CSS)\n";
    cout << "**************************************************\n";

    return 0;
}
